const sort = require('./04-insert-sort');

describe('сортировка вставками', () => {
  it('сортировка четного массива', () => {
    expect(sort([4, 1, 2, 3])).toEqual([1, 2, 3, 4]);
  });
  it('сортировка нечетного массива', () => {
    expect(sort([4, 1, 2, 3, 5])).toEqual([1, 2, 3, 4, 5]);
  });
  it('массив уже отсортирован', () => {
    expect(sort([1, 2, 3, 4, 5])).toEqual([1, 2, 3, 4, 5]);
  });
  it('массив одинаковых чисел', () => {
    expect(sort([1, 1, 1, 1, 1])).toEqual([1, 1, 1, 1, 1]);
  });
  it('пустой массив', () => {
    expect(sort([])).toEqual([]);
  });
  it('сортировка с отрицательными числами', () => {
    expect(sort([-4, 1, 2, 3, 5])).toEqual([-4, 1, 2, 3, 5]);
  });
});
