const bin = require('./02-binary-search-returns-index');

describe('бинарный поиск c возвратом индекса элемента', () => {
  it('элемент есть в массиве', () => {
    expect(bin([1, 2, 3], 3)).toBe(2);
  });
  it('элемент есть в массиве', () => {
    expect(bin([1, 2, 3], 1)).toBe(0);
  });
  it('элемента нет в массиве', () => {
    expect(bin([1, 2, 3], 4)).toBe(-1);
  });
  it('пустой массив', () => {
    expect(bin([], 3)).toBe(-1);
  });
  it('массив из одного элемента', () => {
    expect(bin([3], 3)).toBe(0);
  });
});
